# Exploratory Text Analysis

## What kinds of text analysis are there?

* analyst knows the pattern
    * regular expressions
* analyst does not know the pattern
    * natural language processing
        * compares historical examples to judge novel cases
            * comparisons are statistical and approximate

### Examples of Analysis

When you know the pattern:

In [37]:
pattern = '£ ?[0-9][0-9]?' # £ then SPACE-optional then digit then digit-optional 

document = 'My eggs cost £3, bread cost £2, vodka cost £35'

In [38]:
import re

In [39]:
re.findall(pattern, document)

['£3', '£2', '£35']

If you dont:

* sentiment analysis
    * how positive/negative is this (new) review?
* topic analysis 
    * what is this document about?

## What can I do if I know what pattern I want to find?

* finding ("extracting")
    * what matches the pattern?
* matching ("validating")
    * does the entire document match YES/NO?
* substitue ("replacing")
    * replace a part that matches a pattern with another...

## How do I validate text with pandas?

In [40]:
import pandas as pd

In [60]:
ti = pd.read_csv('titanic.csv')
ti.sample(1)

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
853         1       1  female  16.0  ...     D  Southampton    yes  False

[1 rows x 15 columns]

In [61]:
ti['ticket'] = "Ticket: " + ti['class'] + "; Price: $ " + ti['fare'].astype(str) + "; Port: " + ti['embark_town'] + ";"

In [62]:
ti[['class', 'fare', 'embark_town', 'ticket']].head(3)

   class  ...                                             ticket
0  Third  ...   Ticket: Third; Price: $ 7.25; Port: Southampton;
1  First  ...  Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2  Third  ...  Ticket: Third; Price: $ 7.925; Port: Southampton;

[3 rows x 4 columns]

In [63]:
pattern = '(First|Second)'

ti['class'].str.match(pattern)

0      False
1       True
2      False
3       True
4      False
       ...
886     True
887     True
888    False
889     True
890    False
Name: class, Length: 891, dtype: bool

In [64]:
ti.loc[ ti['class'].str.match(pattern)  , 'survived'].mean()

0.5575

In [65]:
ti.loc[ ti['class'].str.match(pattern)  , 'survived']

1      1
3      1
6      0
9      1
11     1
      ..
880    1
883    0
886    0
887    1
889    1
Name: survived, Length: 400, dtype: int64

## How do I extract data with pandas?

In [68]:
ti[['class', 'fare', 'embark_town', 'age', 'ticket']].head(3)

   class     fare  ...   age                                             ticket
0  Third   7.2500  ...  22.0   Ticket: Third; Price: $ 7.25; Port: Southampton;
1  First  71.2833  ...  38.0  Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2  Third   7.9250  ...  26.0  Ticket: Third; Price: $ 7.925; Port: Southampton;

[3 rows x 5 columns]

In [50]:
pattern = '([0-9.]+)'

ti['ticket'].str.extract(pattern).head(4)

         0
0     7.25
1  71.2833
2    7.925
3     53.1

## How do I substitue text with pandas?

In [51]:
ti['ticket'].str.replace('$', '€').sample(1)

304    Ticket: Third; Price: € 8.05; Port: Southampton;
Name: ticket, dtype: object

## What are regular expressions?

Regular expressions are a language for describing patterns in text. 

They are separate from python, but may be used within python program. (And elsewhere, eg., often in SQL). 

They are notoriously difficult to read and write; and as a separate language, an additional tool to learn.

## What regular expression patterns can I use?

* literals
    * `a`, find me an `a`
    * `£`, find `£`
    * `!` means `!` 
    * ... most symbols mean "find me"
* `.`
    * find any **single** symbol 
* character classes -- find a **single** symbol
    * `[abc]` $\rightarrow$ **either** a, b, c
    * `[0-9]` $\rightarrow$ **either** 0, 1, 2, 3,...9
    * `[A-Z]` $\rightarrow$ **either** capital A, B, ... Z
    * inversions
        * `[^abc]` $\rightarrow$ **is not** `a` OR `b` OR `c`
        * `[^a-zA-Z0-9 ]`  $\rightarrow$ **is not** alphanumeric-ish
    
* alternatives -- find the character**s** given by...
    * `(May|June|July)`  $\rightarrow$ **the whole worlds** May OR June..

In [86]:
ti['ticket']

0       Ticket: Third; Price: $ 7.25; Port: Southampton;
1      Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2      Ticket: Third; Price: $ 7.925; Port: Southampton;
3       Ticket: First; Price: $ 53.1; Port: Southampton;
4       Ticket: Third; Price: $ 8.05; Port: Southampton;
                             ...
886    Ticket: Second; Price: $ 13.0; Port: Southampton;
887     Ticket: First; Price: $ 30.0; Port: Southampton;
888    Ticket: Third; Price: $ 23.45; Port: Southampton;
889       Ticket: First; Price: $ 30.0; Port: Cherbourg;
890      Ticket: Third; Price: $ 7.75; Port: Queenstown;
Name: ticket, Length: 891, dtype: object

In [91]:
ti['ticket'].head(3)

0     Ticket: Third; Price: $ 7.25; Port: Southampton;
1    Ticket: First; Price: $ 71.2833; Port: Cherbourg;
2    Ticket: Third; Price: $ 7.925; Port: Southampton;
Name: ticket, dtype: object

In [ ]:
ti['ticket'].str.extract('(Ticket: (First|Second))')

In [83]:
ti['ticket'].str.extract('([0-9][0-9].[0-9])')

        0
0     NaN
1    71.2
2     NaN
3    53.1
4     NaN
..    ...
886  13.0
887  30.0
888  23.4
889  30.0
890   NaN

[891 rows x 1 columns]

In [77]:
ti['ticket'].head(1)

0    Ticket: Third; Price: $ 7.25; Port: Southampton;
Name: ticket, dtype: object

In [76]:
ti['ticket'].str.extract('(Ticket: [A-Z])').sample(2)

             0
350  Ticket: T
703  Ticket: T

In [82]:
ti['ticket'].str.extract('(T.....:.T)').head(3)

           0
0  Ticket: T
1        NaN
2  Ticket: T

In [95]:
ti['ticket'].str.extract('(Price: [^0-9A-Za-z] ..)').head(3)

             0
0  Price: $ 7.
1  Price: $ 71
2  Price: $ 7.

In [94]:
ti['ticket'].str.extract('(Port: (Cherbourg|Southampton))').head(13)

                    0            1
0   Port: Southampton  Southampton
1     Port: Cherbourg    Cherbourg
2   Port: Southampton  Southampton
3   Port: Southampton  Southampton
4   Port: Southampton  Southampton
5                 NaN          NaN
6   Port: Southampton  Southampton
7   Port: Southampton  Southampton
8   Port: Southampton  Southampton
9     Port: Cherbourg    Cherbourg
10  Port: Southampton  Southampton
11  Port: Southampton  Southampton
12  Port: Southampton  Southampton

* repetitions
    * optional `?`
        * an optional number: `[0-9]?`
    * one or more `+`
        * one or more spaces: ` +`  
    * optional, or more, `*`
        * ` [0-9][0-9]?.[0-9]*`

In [96]:
ti['ticket'].str.extract('([0-9][0-9]?.[0-9]*)').sample(3)

        0
538  14.5
283  8.05
238  10.5

In [97]:
ti['ticket'].str.extract('(Ticket: [a-zA-Z]+)').sample(3)

                  0
696   Ticket: Third
415   Ticket: Third
516  Ticket: Second

In [98]:
row = 0
match = 1 # second match

ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+)').loc[row, match]

0    Port: Southampton
Name: (0, 1), dtype: object

In [99]:
ti['ticket'].str.extract('([a-zA-Z]+tow?n)')

               0
0    Southampton
1            NaN
2    Southampton
3    Southampton
4    Southampton
..           ...
886  Southampton
887  Southampton
888  Southampton
889          NaN
890   Queenstown

[891 rows x 1 columns]

* EXTRA: 
    * escaping
        * How do I say, literally, the `.` symbol?
        * `\.`

In [101]:
ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)').head(2)

           0
0     $ 7.25
1  $ 71.2833

* positional matching
    * `^` means **at the beginning**
    * `$` means **at the end**

In [105]:
ti['ticket'].str.extractall('([a-zA-Z]+: [a-zA-Z]+;$)').sample(5)

                            0
    match
367 0        Port: Cherbourg;
733 0      Port: Southampton;
855 0      Port: Southampton;
271 0      Port: Southampton;
97  0        Port: Cherbourg;

In [ ]:
ti['ticket'].str.extractall('(^[a-zA-Z]+: [a-zA-Z]+;)').sample(1)

                      0
  match
2 0      Ticket: Third;

## Next Steps

* review a "Regex Cheat Sheet"
    * also, eg., https://en.wikipedia.org/wiki/Regular_expression#Examples

## Exercise (30 min)

* find all the words in the tickets 
    * HINT: a word is a repeated letter followed by a space or a colon
    * HINT: `[ :]` means a space or a colon
* find all the USD prices
    * HINT: ``` \$ ``` and repeated numbers 
    
* find all the high-price tickets
    * HINT: consider `\$`, tripple-digit number, `\.`

In [ ]:
Solution

In [114]:
ti['ticket'].str.findall('([a-zA-Z]+[ :])').head(10)

0    [Ticket:, Price:, Port:]
1    [Ticket:, Price:, Port:]
2    [Ticket:, Price:, Port:]
3    [Ticket:, Price:, Port:]
4    [Ticket:, Price:, Port:]
5    [Ticket:, Price:, Port:]
6    [Ticket:, Price:, Port:]
7    [Ticket:, Price:, Port:]
8    [Ticket:, Price:, Port:]
9    [Ticket:, Price:, Port:]
Name: ticket, dtype: object

In [122]:
ti['ticket'].str.extract('(\$ [0-9]+\.[0-9]+)')

             0
0       $ 7.25
1    $ 71.2833
2      $ 7.925
3       $ 53.1
4       $ 8.05
..         ...
886     $ 13.0
887     $ 30.0
888    $ 23.45
889     $ 30.0
890     $ 7.75

[891 rows x 1 columns]

In [121]:
ti['ticket'].str.extractall('(\$ [0-9]+\.[0-9]+)')

                   0
    match
0   0         $ 7.25
1   0      $ 71.2833
2   0        $ 7.925
3   0         $ 53.1
4   0         $ 8.05
...              ...
886 0         $ 13.0
887 0         $ 30.0
888 0        $ 23.45
889 0         $ 30.0
890 0         $ 7.75

[889 rows x 1 columns]

In [118]:
row = 0
match = 1 # second match
ti['ticket'].str.extractall('(\$ [0-9][0-9]+\.[0-9]+)')#.loc[row, 0]

                   0
    match
1   0      $ 71.2833
3   0         $ 53.1
6   0      $ 51.8625
7   0       $ 21.075
8   0      $ 11.1333
...              ...
885 0       $ 29.125
886 0         $ 13.0
887 0         $ 30.0
888 0        $ 23.45
889 0         $ 30.0

[553 rows x 1 columns]